#language: ru
Функционал: Яндекс.Маркет


  Сценарий: Фильтр поиска по наушникам Beats ценой выше 5000

    * выбран пункт меню "Маркет"
    * выбран раздел "Электроника"
    * выбран подраздел "Беспроводные наушники"
    * выполнено нажатие на Все фильтры
    * указано значение фильтра От:"5000"
    * выбран производитель "Beats"
    * выполнено нажатие на Показать
    * количество элементов на странице "6"
    * запомнить в переменную значение элемента с индексом "1"
    * ввести в поиск значение переменной
    * выполнено нажатие на Найти
    * значение элемента с индексом "1" соответствует значению переменной