#language: ru
Функционал: Яндекс.Маркет


  Сценарий: Фильтр поиска по телевизорам LG, Samsung ценой выше 20000

    * выбран пункт меню "Маркет"
    * выбран раздел "Электроника"
    * выбран подраздел "Телевизоры"
    * выполнено нажатие на Все фильтры
    * указано значение фильтра От:"20000"
    * выбран производитель "LG"
    * выбран производитель "Samsung"
    * выполнено нажатие на Показать
    * количество элементов на странице "48"
    * запомнить в переменную значение элемента с индексом "1"
    * ввести в поиск значение переменной
    * выполнено нажатие на Найти
    * значение элемента с индексом "1" соответствует значению переменной